nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8400/driver_examples/cadc/parallel_simultaneous_conversion/pin_mux.h
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOA4 (number 21), J23[2]/J501[38]/J500A[A9]/J500B[C30]/ANA4
  @{ */
#define BOARD_THM0P_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM0P_PIN 4U              /*!<@brief GPIOA pin index: 4 */
#define BOARD_THM0P_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA5 (number 20), J23[4]/J501[40]/J500A[A10]/J500B[C29]/ANA5
  @{ */
#define BOARD_THM0N_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM0N_PIN 5U              /*!<@brief GPIOA pin index: 5 */
#define BOARD_THM0N_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA6 (number 19), J19[2]/J502[2]/J500A[A11]/J500B[C28]/ANA6
  @{ */
#define BOARD_THM1P_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM1P_PIN 6U              /*!<@brief GPIOA pin index: 6 */
#define BOARD_THM1P_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA7 (number 17), J19[4]/J502[4]/J500A[A35]/J500B[C27]/ANA7
  @{ */
#define BOARD_THM1N_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM1N_PIN 7U              /*!<@brief GPIOA pin index: 7 */
#define BOARD_THM1N_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB4 (number 30), J1[2]/J501[35]/J500A[B21]/ANB4
  @{ */
#define BOARD_THM2P_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM2P_PIN 4U              /*!<@brief GPIOB pin index: 4 */
#define BOARD_THM2P_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB5 (number 29), J1[4]/J501[37]/J500A[B22]/ANB5
  @{ */
#define BOARD_THM2N_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM2N_PIN 5U              /*!<@brief GPIOB pin index: 5 */
#define BOARD_THM2N_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB6 (number 28), J2[2]/J501[39]/J500A[B23]/ANB6
  @{ */
#define BOARD_THM3P_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM3P_PIN 6U              /*!<@brief GPIOB pin index: 6 */
#define BOARD_THM3P_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB7 (number 26), J2[4]/J500A[B35]/J501[2]/ANB7
  @{ */
#define BOARD_THM3N_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM3N_PIN 7U              /*!<@brief GPIOB pin index: 7 */
#define BOARD_THM3N_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
